Res-perfCacheNStatA-media/Res-container-random-v1/container_t_10_c_30_composeReviewServiceCore_4_wrkCore_1_R_1500/wrk.txt
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  10 threads and 30 connections
  Thread calibration: mean lat.: 1156.964ms, rate sampling interval: 4042ms
  Thread calibration: mean lat.: 717.483ms, rate sampling interval: 2623ms
  Thread calibration: mean lat.: 1265.852ms, rate sampling interval: 5029ms
  Thread calibration: mean lat.: 956.783ms, rate sampling interval: 3493ms
  Thread calibration: mean lat.: 1311.506ms, rate sampling interval: 4825ms
  Thread calibration: mean lat.: 1328.591ms, rate sampling interval: 4968ms
  Thread calibration: mean lat.: 1099.746ms, rate sampling interval: 3903ms
  Thread calibration: mean lat.: 1141.021ms, rate sampling interval: 4128ms
  Thread calibration: mean lat.: 1334.051ms, rate sampling interval: 4677ms
  Thread calibration: mean lat.: 958.096ms, rate sampling interval: 3264ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.56s     3.54s   15.11s    61.94%
    Req/Sec   115.34      7.45   124.00     87.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.24s 
 75.000%   10.25s 
 90.000%   12.66s 
 99.000%   15.11s 
 99.900%   16.47s 
 99.990%   16.65s 
 99.999%   16.69s 
100.000%   16.70s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1143.807     0.000000            1         1.00
    3002.367     0.100000         5791         1.11
    4055.039     0.200000        11569         1.25
    5210.111     0.300000        17351         1.43
    6246.399     0.400000        23132         1.67
    7241.727     0.500000        28917         2.00
    7794.687     0.550000        31816         2.22
    8323.071     0.600000        34695         2.50
    8912.895     0.650000        37611         2.86
    9625.599     0.700000        40485         3.33
   10248.191     0.750000        43380         4.00
   10543.103     0.775000        44821         4.44
   10838.015     0.800000        46260         5.00
   11296.767     0.825000        47726         5.71
   11706.367     0.850000        49173         6.67
   12083.199     0.875000        50615         8.00
   12320.767     0.887500        51334         8.89
   12656.639     0.900000        52045        10.00
   12967.935     0.912500        52786        11.43
   13221.887     0.925000        53504        13.33
   13475.839     0.937500        54224        16.00
   13713.407     0.943750        54576        17.78
   13860.863     0.950000        54943        20.00
   14049.279     0.956250        55298        22.86
   14262.271     0.962500        55658        26.67
   14434.303     0.968750        56018        32.00
   14508.031     0.971875        56199        35.56
   14630.911     0.975000        56380        40.00
   14745.599     0.978125        56563        45.71
   14835.711     0.981250        56753        53.33
   14925.823     0.984375        56929        64.00
   14966.783     0.985938        57018        71.11
   15015.935     0.987500        57108        80.00
   15073.279     0.989062        57198        91.43
   15130.623     0.990625        57297       106.67
   15179.775     0.992188        57382       128.00
   15204.351     0.992969        57423       142.22
   15228.927     0.993750        57466       160.00
   15269.887     0.994531        57512       182.86
   15343.615     0.995313        57555       213.33
   15548.415     0.996094        57601       256.00
   15646.719     0.996484        57622       284.44
   15728.639     0.996875        57644       320.00
   15843.327     0.997266        57667       365.71
   15998.975     0.997656        57690       426.67
   16113.663     0.998047        57712       512.00
   16154.623     0.998242        57723       568.89
   16187.391     0.998437        57735       640.00
   16244.735     0.998633        57749       731.43
   16343.039     0.998828        57757       853.33
   16474.111     0.999023        57768      1024.00
   16515.071     0.999121        57775      1137.78
   16523.263     0.999219        57780      1280.00
   16531.455     0.999316        57787      1462.86
   16539.647     0.999414        57791      1706.67
   16572.415     0.999512        57798      2048.00
   16580.607     0.999561        57800      2275.56
   16596.991     0.999609        57807      2560.00
   16596.991     0.999658        57807      2925.71
   16605.183     0.999707        57810      3413.33
   16605.183     0.999756        57810      4096.00
   16621.567     0.999780        57814      4551.11
   16621.567     0.999805        57814      5120.00
   16629.759     0.999829        57816      5851.43
   16629.759     0.999854        57816      6826.67
   16637.951     0.999878        57817      8192.00
   16646.143     0.999890        57818      9102.22
   16654.335     0.999902        57821     10240.00
   16654.335     0.999915        57821     11702.86
   16654.335     0.999927        57821     13653.33
   16654.335     0.999939        57821     16384.00
   16654.335     0.999945        57821     18204.44
   16687.103     0.999951        57823     20480.00
   16687.103     0.999957        57823     23405.71
   16687.103     0.999963        57823     27306.67
   16687.103     0.999969        57823     32768.00
   16687.103     0.999973        57823     36408.89
   16687.103     0.999976        57823     40960.00
   16687.103     0.999979        57823     46811.43
   16687.103     0.999982        57823     54613.33
   16695.295     0.999985        57824     65536.00
   16695.295     1.000000        57824          inf
#[Mean    =     7560.697, StdDeviation   =     3543.415]
#[Max     =    16687.104, Total count    =        57824]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  69536 requests in 1.00m, 12.27MB read
  Non-2xx or 3xx responses: 405
Requests/sec:   1158.97
Transfer/sec:    209.39KB